Tekla.Structures.DirectManipulation.Adapter.FusionAppInfo
The Tekla.Structures.DirectManipulation.Adapter.FusionAppInfo class retrieves the information from Fusion Application.

Tekla.Structures.DirectManipulation.Adapter.FusionAppInfo.GetDataFolder
Gets data folder.
Returns: The data folder.

Tekla.Structures.DirectManipulation.Adapter.FusionAppInfo.IsViewerMode
Determines whether the current application is in Viewer mode.
Returns: A value indicating whether the current application is in Viewer mode.